[
 {
  "Journal Rank": "Q1",
  "Journal": "IEEE Access",
  "Paper Title": "Discrimination of Mental Workload Levels From Multi-Channel fNIRS Using Deep Leaning-Based Approaches",
  "Year": "2019",
  "aim\/purpose\/goal\/contribution": "To evaluate the efficiencies of advanced methods differentiating the rest and task periods during Stroop task experiment the affective",
  "dataset": "fNIRS datasets of 16 Subject (volunteers) X 3 HB Types X 7 Channels with two sets, including PCA inputs and non-PCA inputs.  fNIRS device, Shimadzu FOIRE-3000 using near infrared light (with wavelengths of 780, 805, and 830 nm), was used to record hemodynamic activities with 3 types of hemoglobin including HbO, HbR and HbT with seven channels over the PFC region. A 2-by-3 array of T-transmitters (i.e., sources) and R-receivers (i.e., detectors) with 3 cm separation was attached to each subject’s forehead. To stimulate the stress levels of subjects, we used stroop task experiments (STEs) as our experimental protocol that is divided into congruent and incongruent tasks. ",
  "Other technique used for data preprocessing": "The preprocessing steps, such as converting raw signals into hemoglobin values and filtering to remove various noises involved in fNIRS signals, were performed to obtain the clean dataset, called non-PCA inputs. Next, we applied the principal component analysis (PCA) algorithm to get PCA-inputs before putting non-PCA inputs into our four classifiers. This step was expected to enhance the robustness of the mental workload classification scheme by reducing generalization error. computational time as well as preventing overfitting when a million features were processed",
  "ML techniques used (SVM, NN, ensemble, etc.)": "SVM, Adaboost, CNN, DEEP BELIEF NETWORK (DBN)",
  "validation method used (F1-measuer, recall, etc) ": "NA",
  "Results": "the deep learning approaches, including deep belief network and convolutional neural network models, have enabled better classification accuracies of 84.26% ± 2.58% and 72.77% ± 1.92%, respectively",
  "weakness\/limitations\/)": "SVM and AdaBoost took several minutes while DBN and CNN models took hours. To alleviate the time cost for much easier training process of deep learning methods, PCA or any feature extraction\/selection method should be used to reduce input’s dimensionality before putting on DBN and CNN",
  "Future Work ": "a future work, we aim to propose a deep CNN model with higher layers and optimal parameters that can progressively present more complex nonlinear structures and capture high-order correlations of activation units from fNIRS inputs. The training with a larger category of HMS datasets is also an indispensable topic to addres",
  "Note": "The datasets was divied into70% of training set and 30% of testing set for conventional machine learning techniques whilst 70% of training set, 15% of validation set and 15% of testing set for deep learning approaches."
 },
 {
  "Journal Rank": "Q1",
  "Journal": "IEEE Access",
  "Paper Title": "Evaluating the Mental Workload During Robot-Assisted Surgery Utilizing Network Flexibility of Human Brain",
  "Year": "2020",
  "aim\/purpose\/goal\/contribution": "To propose an innovative framework, using dynamic functional brain network measurements and a deep convolutional neural network, to assess MWL for  Robot-assisted Surgery (RAS) application. ",
  "dataset": "Electroencephalogram (EEG) data from 22 trainees who performed basic surgical tasks, as well as four surgical fellows and an expert surgeon who carried out cystectomies and prostatectomies operations. The data was recorded by placing 19 leads of an ABM X-24 neuro-headset (Advanced Brain Monitoring, Inc. Carlsberg, CA) on the Frontal, Prefrontal, Central, Temporal, Parietal, and Occipital cortices ",
  "Other technique used for data preprocessing": "Length of EEG recording is different for each subject and task. The EEG data was filtered with a band-pass filter (0.5-128 Hz). Environmental artifacts were removed by applying a 60 Hz notch filter to EEG data [26], [27]. Muscle activity and eye movement were detected using wavelet transform and discriminant function analyses (DFA) proposed by Berka et al. [27]. Linear DFA was applied to raw data to remove eye blinks.",
  "ML techniques used (SVM, NN, ensemble, etc.)": "They developed a model that combines regional brain network flexibility and a deep CNN to classify mental workload levels. The architecture of our proposed neural network consists of five types of layers: convolutional, pooling, flatten, fully connected, and softmax. The depth of the network was chosen after trial-and-error in the training process.",
  "validation method used (F1-measuer, recall, etc) ": "accuracy, F1-score, sensitivity, and specificity",
  "Results": "The result for the purposed model was 91.24%, 91.28%, 91.27%, 91.28% for accuracy, F1-score, sensitivity, and specificity, resepectivelly. ",
  "weakness\/limitations\/)": "Did not consider the time pressure for the 22 trainees when performing tasks on the simulator which may affect the misclassification, as some subjects took a longer time to complete the tasks, and this may have affected their self-proclaimed assessment. Also, they only recorded EEG data from 19 areas of the brain. This low spatial resolution is another limitation of this study.",
  "Future Work ": "NA",
  "Note": "Their method advantage:  its ability to recognize mental workload levels automatically without a priori dependency on the engineered feature set or surgical gesture detection (segmentation).  Also, It can evaluate mental workload during a surgery in 3-second intervals"
 },
 {
  "Journal Rank": "Q1",
  "Journal": "Computer Methods and Programs in Biomedicine",
  "Paper Title": "COLET: A dataset for COgnitive workLoad estimation based on eye-trackin",
  "Year": "2022",
  "aim\/purpose\/goal\/contribution": "To present COLET: A Dataset for Cognitive workLoad estimation based on Eye-Tracking",
  "dataset": "Forty-seven (47) individuals’ eye movements were monitored as they solved puzzles involving visual search activities of varying complexity and duration. Each activity differs from the others in terms of the existence of time constraint and a secondary task and is rated from the participants based on the NASA RTLX workload index",
  "Other technique used for data preprocessing": "for scaling they used MinMaxScaler function. Furthermore, they constructed a correlation matrix showing correlation coefficients between the variables as a preliminary data interpretation tool and an input into a more advanced analysis, in our case the analysis of variance (ANOVA). Based on the ANOVA repeated measures analysis performed in Section 3.1, we derived the most dominant features for every classification attempt described in the next paragraphs.",
  "ML techniques used (SVM, NN, ensemble, etc.)": "The participants’ cognitive workload level was evaluated with the subjective test of NASA-TLX and this score is used as an annotation of the activity. 8 classifiers were trained and tested during the classification procedure. More specifically: Gaussian Naive Bayes (GNB), Random Forest (RF), Linear Support Vector Machine (SVM), Ensemble Gradient Boosting (EGB), K-Nearest Neighbor (k-NN), Bernoulli Naive Bayes (NB), Logistic Regression (LR) and Decision Trees (DT)",
  "validation method used (F1-measuer, recall, etc) ": "accuracy, F1-score, percesion, recall",
  "Results": "In terms of estimating cognitive workload levels, both binary and multi-class identification tests produced encouraging results, with up to 88% correct predictions between low and high CW with the GNB classifier. Furthermore,",
  "weakness\/limitations\/)": "An analysis of CW levels based not on different activities but on trials themselves was not applied in the current study because of some certain aspects of the study design.  ",
  "Future Work ": "to test their methods and algorithmic approaches on the proposed dataset. New models as well as the applicability of deep learning methods have to be investigated in order to create a model for precisely estimating CW levels with high efficiency. This model could later be used in practical applications, especially in working environments leading to the development of a decision-making system that assesses the mental strain of the worker and provides with recommendations and advice for better time and workload management",
  "Note": "Finally, we split the data into training and testing, with the number of the test data being 20% of the total number of examples, according to the Pareto principle [60]."
 },
 {
  "Journal Rank": "Q1",
  "Journal": "Neurocomputing journal",
  "Paper Title": "Physiological-signal-based mental workload estimation via transfer dynamical autoencoders in a deep learning framework",
  "Year": "2019",
  "aim\/purpose\/goal\/contribution": "To propose a new transfer dynamical autoencoder (TDAE) to capture the dynamical properties of electroencephalograph (EEG) features and the individual differences.",
  "dataset": "three EEG databases were used.The first two databases (TD1 & TD2) are target domain sets, where subjects were engaged with process control tasks under different task demands. These datasets in the authors previous works [11,33] . For the third database, how- ever, EEG signals were recorded along with emotional stimuli and are defined as source domain database for knowledge transferring.",
  "Other technique used for data preprocessing": "They used (PCA) for feature dimensionality reduction, six hybrid classifiers are generated and defined as PCA-LSSVM, PCA-ELM, PCA-NB, PCA-LR, PCA-KNN and PCA-ANN, where the principal components are determined by a threshold of 0.9 for the total variance",
  "ML techniques used (SVM, NN, ensemble, etc.)": "In total, ten different classification methods are adopted and analyzed, i.e., naive Bayesian model (NB), logistic regression (LR), k -nearest neighbor (KNN), ANN, ELM, LSSVM, SAE, DBN, CNN, and the proposed TDAE.",
  "validation method used (F1-measuer, recall, etc) ": "accuracy, F1-score, sensitivity, and specificity on each database+I5",
  "Results": "and multi-class identification tests produced encouraging results, with up to 88% correct predictions between low and high CW with the GNB classifier. Furthermore,",
  "weakness\/limitations\/)": "The limitations of the study are the high computational cost and the restriction of the same paradigm for EEG channel settings when applying knowledge transferring.",
  "Future Work ": "To further investigate the deep learning methods for MW assessment on two aspects.; 1. The computational cost for training the entire network .2. The prerequisite for knowledge transferring across  mental-task domain. ",
  "Note": "The advantage of this method is its effectiveness of the dynamical deep structure in exploiting EEG data from different tasks and subjects for MW recognition. - when the orders of feature and abstraction filters were exhausted by using the grid search, the TDAE performance can be further improved to 0.92"
 },
 {
  "Journal Rank": "Q1",
  "Journal": "IEEE Transactions on Neural Systems and Rehabilitation Engineering ",
  "Paper Title": "Learning Spatial-Spectral-Temporal EEG Features With Recurrent 3D Convolutional Neural Networks for Cross-Task Mental Workload Assessment",
  "Year": "2018",
  "aim\/purpose\/goal\/contribution": "To Learning Spatial-Spectral-Temporal EEG Features With Recurrent 3D Convolutional Neural Networks for Cross-Task Mental Workload Assessment",
  "dataset": "EEG signals collected from twenty subjects. This study employs a binary classification of low and high mental workload across spatial n-back and arithmetic tasks.",
  "Other technique used for data preprocessing": "data augmentation methods using sliding window and adding noise [41] [21] [42]. First,",
  "ML techniques used (SVM, NN, ensemble, etc.)": "concatenation of deep RNN and deep 3D CNN structures (R3DCNN). They compared it to conventional ML models such as; ANN, SVM, LDA, KNN, Deep LSTM, and Deep CNN",
  "validation method used (F1-measuer, recall, etc) ": "Accuracy, sensitivity and specificity ",
  "Results": "The results show that the R3DCNN achieves an average accuracy of 88.9%, which is a significant increase compared with that of the state-of-the-art methods. In addition, the visualization of the convolutional layers demonstrates that the deep neural network can extract detailed features.",
  "weakness\/limitations\/)": "Despite the improvement in accuracy, this model still needs a large number of parameters. Furthermore, this study uses only the spatial n-back and arithmetic tasks as examples to explore cross-task mental workload estimation.",
  "Future Work ": "Future research could simplify the deep learning model and apply it to other mental workload tasks and real-life conditions. The visualization results also need to be further validated with sufficient data and different methods."
 },
 {
  "Journal Rank": "Q2",
  "Journal": "Frontiers in Neuroscience",
  "Paper Title": "Enhanced Accuracy for Multiclass Mental Workload Detection Using Long Short-Term Memory for Brain–Computer Interface",
  "Year": "2020",
  "aim\/purpose\/goal\/contribution": "To estimate four levels of MWL  using a combination of mental logic and MA tasks and also for the first time LSTM is implemented on four-level MWL-fNIRS data with achieved optimum classification accuracies",
  "dataset": "15 subjects participated in this experiment; they also have an educational background in engineering and technology. Before. In this study, 12 channels [12 oxyhemoglobin (HbO) and 12 deoxyhemoglobin (HbR)] and two-wavelength (760 and 850 nm) continuous-wave fNIRS system, namely, “P-fNIRSSyst” is used to measure neuronal activity in form of hemodynamic concentration changes in prefrontal cortex (PFC) (Asgher et al., 2019)",
  "Other technique used for data preprocessing": "to solve high-dimensional four-level cognitive states classification problem. Statistical analysis, t-test, and one-way F-test (ANOVA) are also performed on accuracies obtained through ML and DL algorithms",
  "ML techniques used (SVM, NN, ensemble, etc.)": "four-state MWLs were evaluated and classified using three ML (SVM, k-NN, and ANN) and two DL (CNN and LSTM) algorithms using fNIRS hemodynamics signals",
  "validation method used (F1-measuer, recall, etc) ": "accuracy, precision, recall",
  "Results": "The highest accuracy achieved with LSTM is 95.51% Overall, Results show that the proposed DL (LSTM and CNN) algorithms significantly improve classification performance as compared with ML (SVM, ANN, and k-NN) algorithms.",
  "weakness\/limitations\/)": "NA ",
  "Future Work ": "In future research, SWAT analysis can also be used to gauge the strength and reliability of an experimental paradigm. Further research could be used to explore the full potential of LSTM in a multitask environment with the application of big data MWL analysis using real-time neuroergonomics and neurofeedback settings"
 },
 {
  "Journal Rank": "Q1",
  "Journal": "Sensors",
  "Paper Title": "Sensor Location Optimization of Wireless Wearable fNIRS System for Cognitive Workload Monitoring Using a Data-Driven Approach for Improved Wearability",
  "Year": "2020",
  "aim\/purpose\/goal\/contribution": "to investigate how the cognitive workload monitoring accuracy varied across the sensing locations on the forehead, the variability arising from the human subjects was assumed to be minimal, and the number of participants in this study was decided by considering common practice in other relevant studies",
  "dataset": "Eight healthy volunteers (six males and two females), with no history of neurovascular and cognitive disorders, participated in this study",
  "Other technique used for data preprocessing": "For feature selection, two algorithms were used, namely, the Sequential Forward Selection (SFS) Wrapper algorithm [58] for feature subset selection and Relief algorithm [59,60]. Each of these algorithms has its own merits with respect to the statistical relevance (Relief) of the features to the classes [59] and the interaction of the training feature set (SFS) with the classifier algorithm [58]. Thus, both of the selected feature sets returned by these two algorithms were individually used in the classification using the linear SVM. The classification with the best accuracy among these two classification results was used in the statistical analysis. In this respect, as the SFS claims to return an optimal feature subset by heuristic search, the whole subset of the returned features was used in classification. On the other hand, as the Relief algorithm instead returns the ranks and weights for all the features, only the features with positive weights were used in the classification",
  "ML techniques used (SVM, NN, ensemble, etc.)": "Linear SVM",
  "validation method used (F1-measuer, recall, etc) ": "Accuracy, F1-score, sensitivity, specificity, and precision. In addition, to find the statistical significance of the differences in the mean classification accuracies for all subjects for each location (Left, Mid, Right, Left-Mid and Right-Mid) from the accuracy for the whole forehead location (Whole), a two-sample t-test was applied with a 5% significance level, which decided whether the means were statistically equal or not at that significance level.",
  "Results": "NA",
  "weakness\/limitations\/)": "In this study, only the immobile state of the subject was considered. ",
  "Future Work ": "investigate whether there are any subject-dependent variabilities in sensor location optimization for wearable fNIRS system design. The extracerebral tissue layer signal interferences were assumed to be minimal and similar in both the 2-back and resting-state signals. A future study may utilize a short separation channel to investigate these interferences. Also, another promising future direction might be to investigate the effect of motion on sensor location optimization. Supplementary",
  "Note": "They used 10 cross-validation method. "
 },
 {
  "Journal Rank": "Q1",
  "Journal": "Biomedical Signal Processing and Control",
  "Paper Title": "EEG-based mental workload estimation using deep BLSTM-LSTM network and evolutionary algorithm",
  "Year": "2020",
  "aim\/purpose\/goal\/contribution": "to estimate the workload level during the multitasking mental activities of human subjects",
  "dataset": "“STEW” dataset The dataset consists of two tasks, namely “No task” and “simultaneous capacity (SIMKAP)-based multitasking activity”.",
  "Other technique used for data preprocessing": "GWO algorithm has been used to select optimized features related to mental activities. Other optimization techniques such as Genetic Algorithm (GA), Particle Swarm Opti- mization (PSO) are generally slower compared to the convergence rate of GWO",
  "ML techniques used (SVM, NN, ensemble, etc.)": "Framework consists of Grey Wolf Optimizer (GWO) and deep neural network (GWO algorithm and deep BLSTM-LSTM neural model)",
  "validation method used (F1-measuer, recall, etc) ": "Accuracy - FAR - FRR",
  "Results": "A deep hybrid model based on Bidirectional Long Short-Term Memory (BLSTM) and Long Short-Term Memory (LSTM) has been proposed for the classification of workload levels. The proposed deep model achieves 86.33% and 82.57% classification accuracy for “No task” and “SIMKAP-based multitasking activity,” respectively",
  "weakness\/limitations\/)": "pros: -Robust deep neural network model to accomplish the task. -Toidentifythebestfeatures,wehaveperformedGrey-WolfOpti- mization (GWO) technique rather than choosing the features extracted from traditional deep neural network models  cons: -one dataset -focuses on only two mwl tasks",
  "Future Work ": "In the future, the model can be extended with classifying more challenging tasks related to mental workload. In addition to that, patterns of each brain’s region during the different tasks can be identified using brain connectivity analysis.",
  "Note": "The proposed model has been tested on public dataset [stew] for evaluating the performance."
 },
 {
  "Journal Rank": "Q1",
  "Journal": "Ergonomics",
  "Paper Title": "Measurement and identification of mental workload during simulated computer tasks with multimodal methods and machine learning",
  "Year": "2020",
  "aim\/purpose\/goal\/contribution": "To multimodally measure mental workload and validate indicators for estimating mental workload",
  "dataset": "Behavioural, physiological, physiological",
  "Other technique used for data preprocessing": "feature scale",
  "ML techniques used (SVM, NN, ensemble, etc.)": "A simulated computer work composed of mental arithmetic tasks with different levels of difficulty was designed and used in the experiment to measure physiological signals ((heart rate, heart rate variability, electromyography, electrodermal activity, and respiration), subjective ratings of mental workload (the NASA Task Load Index), and task performance)",
  "validation method used (F1-measuer, recall, etc) ": "accuracy, recall, and precision",
  "Results": "There were no significant differences between the average heart rate and the low-frequency\/high-frequency ratio among tasks The classification of mental workload using combined indices as inputs showed that classification models combining physiological signals and task performance can reach satisfying accuracy at 96.4% and an accuracy of 78.3% when only using physiological indices as inputs. The present study also showed that ECG and EDA signals have good discriminating power for mental workload detection.",
  "weakness\/limitations\/)": "The indices from electrodermal activity and respiration had a significant increment as task difficulty increased. Pros: The study was conducted in a laboratory with the advantage of the experimental conditions being carefully controlled Cons: it is difficult to identify task demand in the actual environment and physiological signal collection will also be affected by the real environment - the participants in the experiment were all male university students - the peripheral and EEG indices should be combined in the prediction of mental workload",
  "Future Work ": " different types of tasks should be considered - how to define the ‘red zone’ at which workload becomes unacceptable should be investigated - how to promote effective interventions to reduce effort demand and at the same time retain work performance are two critical issues - smart offices can measure and identify mental workload automatically then provide suggestions for a break when mental workload approximates the ‘red zone.’"
 },
 {
  "Journal Rank": "Q1",
  "Journal": "IEEE Access",
  "Paper Title": "Multilevel Feature Fusion With 3D Convolutional Neural Network for EEG-Based Workload Estimation",
  "Year": "2020",
  "aim\/purpose\/goal\/contribution": "to propose a three-dimensional convolutional neural network (3D CNN) employing a multilevel feature fusion algorithm for mental workload estimation",
  "dataset": "Starstim R32 (Neuroelectrcis, Spain) was utilized to record the EEG signals.",
  "Other technique used for data preprocessing": "Multilevel features are extracted in each layer of the 3D convolution operation and each multilevel feature is multiplied by a weighting factor, which determines the importance of the feature",
  "ML techniques used (SVM, NN, ensemble, etc.)": "propose a temporal attention technique based on the long short-term memory model (LSTM) to extract a significant subframe at each multilevel feature that is strongly correlated with task difficulty",
  "validation method used (F1-measuer, recall, etc) ": "To verify the performance of our network, we performed the Sternberg task to measure the mental workload of the participant Preprocessing was performed with MATLAB (MathWorks Inc., Natick, MA). In the working memory task, memory operations are primarily related to oscillations with frequency between 4 Hz and 30 Hz [7]–[10], [40]. Based on prior knowledge, the EEG signals are first band-pass filtered in a frequency band from 0.5 Hz to 40 Hz, which removes the direct current component and high-frequency noises. Then, the filtered signals are down-sampled to 100 Hz.",
  "Results": "We showed that the difficulty of the workload was well designed, which was reflected in the behavior of the participant.  Our network is trained on this dataset and the accuracy of our network is 90.8 %, which is better than that of conventional algorithms. We also evaluated our method using the public EEG dataset and achieved 93.9 % accuracy.",
  "weakness\/limitations\/)": "pros: To verify the generalization of the proposed multilevel feature fusion method, we evaluate the performance using the pub- lic EEG dataset for workload estimation published in [16]",
  "Future Work ": "NA"
 },
 {
  "Journal Rank": "Q2",
  "Journal": "Frontiers in Neuroscience",
  "Paper Title": "Motor Training Using Mental Workload (MWL) With an Assistive Soft Exoskeleton System: A Functional Near-Infrared Spectroscopy (fNIRS) Study for Brain–Machine Interface (BMI)",
  "Year": "2021",
  "aim\/purpose\/goal\/contribution": "to designing a lightweight wearable robotic exoskeleton hand that is used to assist the potential stroke patients with an integrated portable brain interface using mental workload (MWL) signals acquired with portable functional near-infrared spectroscopy (fNIRS) system.",
  "dataset": "The fNIRS system is used to record optical signals in the form of change in concentration of oxy and deoxygenated hemoglobin (HbO and HbR) from the pre-frontal cortex (PFC) region of the brain",
  "Other technique used for data preprocessing": "Features are selected based on data information in terms of important details",
  "ML techniques used (SVM, NN, ensemble, etc.)": "machine learning classifier—support vector machines (SVM)",
  "validation method used (F1-measuer, recall, etc) ": "validate the design on healthy patients",
  "Results": "Support vector machine (SVM) classifiers are used to generate command signals (open or close) for the prosthetic hand. The maximum classification accuracy is 91.31%, with an average accuracy of 87.9% and an average information transfer rate (ITR) of 1.43. The results show the effectiveness of the proposed brain–machine interface (BMI) system for potential patients having difficulties in grasping tasks",
  "weakness\/limitations\/)": "the full system has to be tested in the future on actual patients with varying levels of MWL",
  "Future Work ": "experimentation with small task duration windows could help faster command generation with time reduction in future research while keeping the accuracy and ITR at desired levels to introduce the adaptive force control for grasping tasks and GUI for the physiotherapist’s operational use to extend our experiments and perform real-time classification on patients with motor disabilities",
  "Note": "Fifteen participants participated in this study and were given hand-grasping tasks"
 },
 {
  "Journal Rank": "Q1",
  "Journal": "IEEE Sensors",
  "Paper Title": "Classification of Cognitive Load based on Neurophysiological Features from Functional Near-Infrared Spectroscopy and Electrocardiography Signals on n-back Task",
  "Year": "2020",
  "aim\/purpose\/goal\/contribution": "to classify three levels of cognitive load on n-back task",
  "dataset": "the fNIRS and ECG signals were simultaneously collected from 32 participants",
  "Other technique used for data preprocessing": "A set of 30 fNIRS and ECG features proposed in this paper",
  "ML techniques used (SVM, NN, ensemble, etc.)": "using the support vector machine (SVM), k-nearest neighbors (KNN), and linear discriminant analysis (LDA) classification models",
  "validation method used (F1-measuer, recall, etc) ": "The training process for all models was carried out using nested leave-one-subject-out (LOSO) crossvalidation, Classification accuracy, The receiver operating characteristic (ROC) curve was calculated for all the 2-level classifiers, The area under ROC curve (AUC) was calculated for all the 2-level classifiers, as well as for the 3-level classifiers",
  "Results": "When combining the fNIRS and ECG features, three difficulties of the n-back task were classified with the mean accuracies ranging from 61% to 67%, while two difficulties were classified with the mean accuracy ranging from 70% to 84%",
  "weakness\/limitations\/)": "pros: The most important features in the classification are discussed Comparison of different machine learning algorithms which strengthen the robustness of our finding that a combination cons: 28 male and 4 female - However, translation of laboratory research results into practice needs further studies demonstrating attainable accuracies of multimodal cognitive load classification in more realistic job-specific settings, while taking into account the obtrusiveness, cost and overall suitability of selected data collection methods for each targeted real-world occupational environment.",
  "Future Work ": "few possible future directions in the classification of cognitive load based on the multimodal data can be pointed out. As already stated, adequate feature selection, which is a common research topic [52], [54], [55], is the prerequisite for cognitive load classification. In the fNIRS data analysis, the feature sets are mostly based on mean activation during the task, since that feature is marked as the most important feature in cognitive load classification in previous research [55]. -Another approach for increasing classification accuracies might be the addition of other modalities to the experimental protocol, particularly when aiming to classify multiple levels of cognitive load,"
 },
 {
  "Journal Rank": "Q1",
  "Journal": "Robotics",
  "Paper Title": "Adaptive Human-Robot Interactions for Multiple Unmanned Aerial Vehicles",
  "Year": "2021",
  "aim\/purpose\/goal\/contribution": "to presents the development and evaluation of cognitive human-machine interfaces and interactions (CHMI2) supporting adaptive automation in OTM applications",
  "dataset": "neurophysiological sensors (data) and machine-learning based models for inferring user cognitive states",
  "ML techniques used (SVM, NN, ensemble, etc.)": "The CHMI2 module was subsequently integrated into the simulation environment, providing the sensing, inference, and adaptation capabilities needed to realise adaptive automation",
  "validation method used (F1-measuer, recall, etc) ": "root mean squared error (RMSE)",
  "Results": "results from the online adaptation phase showed that the system was able to support real-time inference and human-machine interface and interaction (HMI2) adaptation",
  "weakness\/limitations\/)": "the accuracy of the inferred workload was variable across the different participants, root mean squared error (RMSE) ranging from 0.2 to 0.6",
  "Future Work ": "to investigate the use of alternative machine learning techniques, additional neurophysiological input features, and a more extensive training stage."
 },
 {
  "Journal Rank": "Q1",
  "Journal": "Journal of Computing in Civil Engineering",
  "Paper Title": "Physiological Data Models to Understand the Effectiveness of Drone Operation Training in Immersive Virtual Reality",
  "Year": "2020",
  "aim\/purpose\/goal\/contribution": "to investigates the reliability of using the drone operator’s physiological indexes and self-assessments to predict performance, mental workload (MWL), and stress in immersive virtual reality training and outdoor deployment",
  "dataset": "A user study was carried out to collect physiological data using wearable devices and design general population and group-specific prediction models",
  "ML techniques used (SVM, NN, ensemble, etc.)": "generalizable machine learning models that learn the interdependencies between physiological and self-assessment inputs and their association with corresponding outcomes. LR trained on the top three features yielded the lowest RMSE in performance prediction. SVM trained on the top two features yielded the lowest RMSE in MWL prediction. DT trained on the top five features yielded the lowest RMSE in stress prediction. Group specific models (based on session type, session order, and participant’s gender) were trained to predict performance, MWL, and stress levels. In total, 18 models were developed (three groups, two training\/testing combinations per group, three outcomes).",
  "validation method used (F1-measuer, recall, etc) ": "root mean squared error (RMSE)",
  "Results": "Results show that in 83% of cases, these models can predict performance, MWL, and stress levels accurately or within one level",
  "weakness\/limitations\/)": "pros: providing a scalable approach to objectively quantifying performance, MWL, and stress that can be used to design adaptive training systems for drone operators",
  "Future Work ": "Potential disparities between prediction outcomes in VR and real-world experiments can be further quantified and utilized as objective measures to calibrate the degree of immersion of the VR model for future training."
 },
 {
  "Journal Rank": "Q1",
  "Journal": "IEEE Journal of Biomedical and Health Informatics",
  "Paper Title": "Machine-Learning Based Monitoring of Cognitive Workload in Rescue Missions With Drones",
  "Year": "2022",
  "aim\/purpose\/goal\/contribution": "to propose a machine learning algorithm for real-time cognitive workload monitoring to understand if a search and rescue operator has to be replaced or if more resources are required",
  "dataset": "25 features extracted from physiological signals",
  "Other technique used for data preprocessing": "explore different feature normalization techniques, and introduce a novel weighted-learning method based on support vector machines, Features Selection",
  "ML techniques used (SVM, NN, ensemble, etc.)": "support vector machines",
  "Results": "our proposed subject-specific model is able to distinguish between low and high cognitive workloads with an average accuracy of 87.3% and 91.2% while controlling a drone simulator using both a traditional controller and a new-generation controller, respectively.",
  "weakness\/limitations\/)": "pros: The proposed methodology paves the way for detecting high levels of cognitive workload with sensors that can be included into a jacket. - model can already operate in real-time to obtain information of the cognitive workload of the user",
  "Future Work ": "further investigations in real-life scenarios are needed to model other stressful conditions, which are not reproducible in laboratory tests. there is a need to address a fine-grained detection in order to define a threshold for preventing a possible pilot’s overload that could compromise the outcome of a search and rescue mission",
  "Note": "On an unseen test set acquired from 34 volunteers"
 }
]
